const Discord = require('discord.js');
const client = new Discord.Client();
console.log("Scrpit By Dream");


client.on("ready", () => {
let channel =     client.channels.get("524490444617285643")
setInterval(function() {
channel.send(`شعر في الحكمة من أكثر الشعراء الذين عرفوا بجمال شعر الحكمة لديهم هو الشافعي , و تلك هي واحدة من قصائده المرتبطة بالحكمة : دع الأيام تفعل ما تشاء ..... وطب نفسا إذا حكم القضاء ولا تجزع لحادثة الليالي ..... فما لحوادث الدنيا بقاء وكن رجلا على الأهوال جلدا ..... وشيمتك السماحة والوفاء وإن كثرت عيوبك في البرايا ..... وسرك أن يكون لها غطاء تستر بالسخاء فكل عيب ..... يغطيه كما قيل السخاء ولا تر للأعادي قط ذلا ..... فإن شماتة الأعدا بلاء ولا ترج السماحة من بخيل ..... فما في النار للظمآن ماء ورزقك ليس ينقصه التأني ..... وليس يزيد في الرزق العناء ولا حزن يدوم ولا سرور ..... ولا بؤس عليك ولا رخاء إذا ما كنت ذا قلب قنوع ..... فأنت ومالك الدنيا سواء ومن نزلت بساحته المنايا ..... فلا أرض تقيه ولا سماء وأرض الله واسعة ولكن ..... إذا نزل القضا ضاق الفضاء دع الأيام تغدر كل حين ..... فما يغني عن الموت الدواء أجمل ما يقول في الدعوة إلى التنقل والترحال تلك الأبيات : ما في المقام لذي عـقـل وذي أدب ... من راحة فدع الأوطان واغتـرب سافر تجد عوضـا عمن تفارقــه ... وانْصَبْ فإن لذيذ العيش في النَّصب إني رأيت ركـود الـماء يفســده ... إن ساح طاب وإن لم يجر لم يطب والأسد لولا فراق الغاب ما افترست ... والسهم لولا فراق القوس لم يصب والشمس لو وقفت في الفلك دائمة ... لملَّها الناس من عجم ومن عـرب والتِّبرُ كالتُّـرب مُلقى في أماكنـه ... والعود في أرضه نوع من الحطب فإن تغرّب هـذا عـَزّ م

إقرأ المزيد على موضوع.كوم`);
}, 30)
})

client.login(process.env.BOT_TOKEN);